RT-Thread/rt-thread/bsp/nuvoton_nuc472/Libraries/StdDriver/src/rtc.c
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    if (u32TimeMode == RTC_CLOCK_12) {
        RTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;

        if (u32AmPm == RTC_PM)    /* important, range of 12-hour PM mode is 21 up to 32 */
            u32Hour += 20;
    } else if(u32TimeMode == RTC_CLOCK_24) {
        RTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
    }

    u32Reg     = ((u32Hour   / 10) << 20);
    u32Reg    |= ((u32Hour   % 10) << 16);
    u32Reg    |= ((u32Minute / 10) << 12);
    u32Reg    |= ((u32Minute % 10) <<  8);
    u32Reg    |= ((u32Second / 10) <<  4);
    u32Reg    |=  (u32Second % 10);

    g_u32Reg = u32Reg;

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    RTC->TALM = (uint32_t)g_u32Reg;

}


/**
 *  @brief    The spare registers access enable
 *
 *  @return   None
 *
 */
void RTC_EnableSpareAccess(void)
{
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    RTC->SPRCTL |= RTC_SPRCTL_SPRRWEN_Msk;

    while(!(RTC->SPRCTL & RTC_SPRCTL_SPRRWRDY_Msk));
}


/**
 *  @brief    This function is used to:
 *            1. Enable tamper detection function.            \n
 *            2. Set tamper detect pin number.                \n
 *            3. Set tamper control register, interrupt.      \n
 *            4. Clear tamper status.                         \n
 *            5. Destroy Spare Register when tamper detected  \n
 *
 *  @param[in]    u32PinNumber    tamper detect pin number. [ \ref RTC_TAMPER_0 / \ref RTC_TAMPER_1]
 *  @param[in]    u32PinCondition set tamper detection condition: 1=High level detect, 0=Low level detect
 *  @param[in]    u32IntFlag Enable/Disable tamper interrupt: 1=Enable, 0=Disable
 *  @param[in]    u32ClearFlag Clear tamper status
 *  @param[in]    u32DestroyEn Enable/Disable Destroy Spare Register when tamper detected: 1=Enable, 0=Disable
 *
 *  @return   None
 *
 */
void RTC_EnableTamperDetection(uint32_t u32PinNumber, uint32_t u32PinCondition, uint32_t u32IntFlag, uint32_t u32ClearFlag, uint32_t u32DestroyEn)
{
    uint32_t u32Tmp;

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    u32Tmp = RTC->TAMPCTL;

    if(u32PinNumber == RTC_TAMPER_0) {
        //if(u32ClearFlag)
        //    RTC->TAMPSTS = RTC_TAMPSTS_TAMPSTS0_Msk;

        if(u32PinCondition)
            u32Tmp |= RTC_TAMPCTL_TAMPLV0_Msk;
        else
            u32Tmp &= ~RTC_TAMPCTL_TAMPLV0_Msk;

        u32Tmp |= RTC_TAMPCTL_TAMPDBEN0_Msk;
        u32Tmp |= RTC_TAMPCTL_TAMPEN0_Msk;
    } else if(u32PinNumber == RTC_TAMPER_1) {
        //if(u32ClearFlag)
        //    RTC->TAMPSTS = RTC_TAMPSTS_TAMPSTS1_Msk;

        if(u32PinCondition)
            u32Tmp |= RTC_TAMPCTL_TAMPLV1_Msk;
        else
            u32Tmp &= ~RTC_TAMPCTL_TAMPLV1_Msk;

        u32Tmp |= RTC_TAMPCTL_TAMPDBEN1_Msk;
        u32Tmp |= RTC_TAMPCTL_TAMPEN1_Msk;
    }

    if(u32IntFlag)
        u32Tmp |= RTC_TAMPCTL_TIEN_Msk;
    else
        u32Tmp &= ~RTC_TAMPCTL_TIEN_Msk;

    if(u32DestroyEn)
        u32Tmp |= RTC_TAMPCTL_DESTROYEN_Msk;
    else
        u32Tmp &= ~RTC_TAMPCTL_DESTROYEN_Msk;

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    RTC->TAMPCTL = u32Tmp;

    while(RTC->RWEN & RTC_RWEN_RWENF_Msk);

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    if(u32PinNumber == RTC_TAMPER_0) {
        if(u32ClearFlag)
            RTC->TAMPSTS = RTC_TAMPSTS_TAMPSTS0_Msk;
    } else if(u32PinNumber == RTC_TAMPER_1) {
        if(u32ClearFlag)
            RTC->TAMPSTS = RTC_TAMPSTS_TAMPSTS1_Msk;
    }
}

/**
 *  @brief    This function is used to disable tamper detection function.
 *
 *  @param[in]    u32PinNumber    tamper detect pin number: \ref RTC_TAMPER_0, \ref RTC_TAMPER_1
 *
 *  @return   None
 *
 */
void RTC_DisableTamperDetection(uint32_t u32PinNumber)
{
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    if(u32PinNumber == RTC_TAMPER_0) {
        RTC->TAMPCTL &= ~RTC_TAMPCTL_TAMPEN0_Msk;
    } else if(u32PinNumber == RTC_TAMPER_1) {
        RTC->TAMPCTL &= ~RTC_TAMPCTL_TAMPEN1_Msk;
    }

}

/**
 *  @brief    This function is used to get day of week.
 *
 *  @param    None
 *
 *  @return   Day of week
 *
 */
uint32_t RTC_GetDayOfWeek(void)
{
    return (RTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk);
}

/**
 *  @brief    The function is used to set time tick period for periodic time tick Interrupt.
 *
 *  @param[in]    u32TickSelection
 *                       It is used to set the RTC time tick period for Periodic Time Tick Interrupt request.
 *                       It consists of: \n
 *                       - \ref RTC_TICK_1_SEC : Time tick is 1 second        \n
 *                       - \ref RTC_TICK_1_2_SEC : Time tick is 1/2 second    \n
 *                       - \ref RTC_TICK_1_4_SEC : Time tick is 1/4 second    \n
 *                       - \ref RTC_TICK_1_8_SEC : Time tick is 1/8 second    \n
 *                       - \ref RTC_TICK_1_16_SEC : Time tick is 1/16 second  \n
 *                       - \ref RTC_TICK_1_32_SEC : Time tick is 1/32 second  \n
 *                       - \ref RTC_TICK_1_64_SEC : Time tick is 1/64 second  \n
 *                       - \ref RTC_TICK_1_128_SEC : Time tick is 1/128 second
 *
 *  @return   None
 *
 */
void RTC_SetTickPeriod(uint32_t u32TickSelection)
{
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    RTC->TICK = RTC->TICK & ~RTC_TICK_TICKSEL_Msk | u32TickSelection;
}

/**
 *  @brief    The function is used to enable specified interrupt.
 *
 *  @param[in]    u32IntFlagMask      The structure of interrupt source. It consists of: \n
 *                                \ref RTC_INTEN_ALMIEN_Msk : Alarm interrupt                  \n
 *                                \ref RTC_INTEN_TICKIEN_Msk : Tick interrupt                    \n
 *
 *  @return   None
 *
 */
void RTC_EnableInt(uint32_t u32IntFlagMask)
{
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    RTC->INTEN |= u32IntFlagMask;
}

/**
 *  @brief    The function is used to disable specified interrupt.
 *
 *  @param[in]    u32IntFlagMask      The structure of interrupt source. It consists of: \n
 *                                \ref RTC_INTEN_ALMIEN_Msk : Alarm interrupt                  \n
 *                                \ref RTC_INTEN_TICKIEN_Msk : Tick interrupt                    \n
 *
 *  @return  None
 *
 */
void RTC_DisableInt(uint32_t u32IntFlagMask)
{
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));

    if(u32IntFlagMask & RTC_INTEN_TICKIEN_Msk) {
        RTC->INTEN  &= ~RTC_INTEN_TICKIEN_Msk;
        RTC->INTSTS |= RTC_INTSTS_TICKIF_Msk;
    }

    if(u32IntFlagMask & RTC_INTEN_ALMIEN_Msk) {
        RTC->INTEN &= ~RTC_INTEN_ALMIEN_Msk;
        RTC->INTSTS |= RTC_INTSTS_ALMIF_Msk;
    }

}

/**
 *  @brief    Disable RTC clock.
 *
 *  @return   None
 *
 */
void RTC_Close (void)
{
    CLK->APBCLK0  &= ~CLK_APBCLK0_RTCCKEN_Msk;
}


/*@}*/ /* end of group NUC472_442_RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC472_442_RTC_Driver */

/*@}*/ /* end of group NUC472_442_Device_Driver */

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/


